andyelsen85-bit/Range-Master/artifacts/firmware/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision — Guition JC8012P4A1C uses ESP32-P4 rev v1.3 (ECO2) ───
# REQUIRED: use IDF 5.3.x ONLY.
#   IDF 5.4.2+: hangs in esp_lcd_new_dsi_bus() on ECO2 D-PHY (IDF issue #17778)
#   IDF 5.5.x+: refuses ECO2 entirely (requires v3.1+)
# CONFIG_ESP32P4_REV_MIN_FULL=100 tells the bootloader to accept v1.0+ chips.
CONFIG_ESP32P4_REV_MIN_FULL=100

# ── Flash (JC8012P4A1C has 16 MB flash) ───────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── PSRAM ─────────────────────────────────────────────────────────────────
# ESP32-P4 uses HEX PSRAM (AP Memory X16) — requires MODE_HEX, not MODE_OCT.
# Without CONFIG_SPIRAM_MODE_HEX=y the speed choice has no valid mode to attach
# to and is silently ignored, leaving PSRAM stuck at the 20 MHz default.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ── MIPI DSI ──────────────────────────────────────────────────────────────
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ── Power management — REQUIRED for MIPI DSI on ESP32-P4 IDF 5.3.x ───────
# Without CONFIG_PM_ENABLE, esp_perip_clk_init() is a no-op stub (warning:
# "has not been implemented yet"). The MIPI DSI D-PHY PLL reference clock
# (MIPI_DSI_DPHY_PLL_REFCLK_EN) is never enabled, so esp_lcd_new_dsi_bus()
# hangs forever waiting for PLL lock. PM_ENABLE triggers the full clock-init
# path and opens those gates before our display init runs.
CONFIG_PM_ENABLE=y
# Keep tickless idle off — our LVGL loop always has work to do and we don't
# want the scheduler sleeping under the display task.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── HTTP client ───────────────────────────────────────────────────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ── NVS ───────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── UART ──────────────────────────────────────────────────────────────────
CONFIG_UART_ISR_IN_IRAM=y

# ── Log level ─────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Partition table ───────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── Stack sizes ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# ── LVGL Montserrat fonts (all sizes used by the UI screens) ──
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

